https://towardsdatascience.com/5-must-know-pandas-operations-on-strings-4f88ca6b8e25

In [8]:
import numpy as np
import pandas as pd
sample = {
'col_a':['Houston,TX', 'Dallas,TX', 'Chicago,IL', 'Phoenix,AZ','SanDiego,CA'],
'col_b':['$64K-$72K', '$62K-$70K', '$69K-$76K', '$62K-$72K', '$71K-$78K' ],
'col_c':['A','B','A','a','c'],
'col_d':['  1x', ' 1y', '2x  ', '1x', '1y  ']
}
df_sample = pd.DataFrame(sample)
df_sample

         col_a      col_b col_c col_d
0   Houston,TX  $64K-$72K     A    1x
1    Dallas,TX  $62K-$70K     B    1y
2   Chicago,IL  $69K-$76K     A  2x
3   Phoenix,AZ  $62K-$72K     a    1x
4  SanDiego,CA  $71K-$78K     c  1y

In [9]:
df_sample['col_a'].str.split(',')
0      [Houston, TX] 
1       [Dallas, TX] 
2      [Chicago, IL] 
3      [Phoenix, AZ] 
4    [San Diego, CA] 
Name: col_a, dtype: object

SyntaxError: invalid syntax (Temp/ipykernel_5508/2893546346.py, line 6)

In [10]:
df_sample['state'] = df_sample['col_a'].str.split(',').str[1]
df_sample

         col_a      col_b col_c col_d state
0   Houston,TX  $64K-$72K     A    1x    TX
1    Dallas,TX  $62K-$70K     B    1y    TX
2   Chicago,IL  $69K-$76K     A  2x      IL
3   Phoenix,AZ  $62K-$72K     a    1x    AZ
4  SanDiego,CA  $71K-$78K     c  1y      CA

In [11]:
df_sample['col_b'].str.lstrip('$')

0    64K-$72K
1    62K-$70K
2    69K-$76K
3    62K-$72K
4    71K-$78K
Name: col_b, dtype: object

In [13]:
df_sample['col_d'] = df_sample['col_d'].str.strip()
display(df_sample)

         col_a      col_b col_c col_d state
0   Houston,TX  $64K-$72K     A    1x    TX
1    Dallas,TX  $62K-$70K     B    1y    TX
2   Chicago,IL  $69K-$76K     A    2x    IL
3   Phoenix,AZ  $62K-$72K     a    1x    AZ
4  SanDiego,CA  $71K-$78K     c    1y    CA

In [15]:
df_sample['col_d'] = df_sample['col_d'].str.replace('x', 'z')
print(df_sample)

         col_a      col_b col_c col_d state
0   Houston,TX  $64K-$72K     A    1z    TX
1    Dallas,TX  $62K-$70K     B    1y    TX
2   Chicago,IL  $69K-$76K     A    2z    IL
3   Phoenix,AZ  $62K-$72K     a    1z    AZ
4  SanDiego,CA  $71K-$78K     c    1y    CA

In [17]:
df_sample[df_sample['col_a'].str.endswith('X')]
display(df_sample[df_sample['col_a'].str.endswith('X')])

        col_a      col_b col_c col_d state
0  Houston,TX  $64K-$72K     A    1z    TX
1   Dallas,TX  $62K-$70K     B    1y    TX

In [18]:
display(df_sample[df_sample['col_b'].str.startswith('$6')])

        col_a      col_b col_c col_d state
0  Houston,TX  $64K-$72K     A    1z    TX
1   Dallas,TX  $62K-$70K     B    1y    TX
2  Chicago,IL  $69K-$76K     A    2z    IL
3  Phoenix,AZ  $62K-$72K     a    1z    AZ

In [20]:
print(df_sample)
upper  = df_sample['col_b'].str[-3:-1]
print(upper)

         col_a      col_b col_c col_d state
0   Houston,TX  $64K-$72K     A    1z    TX
1    Dallas,TX  $62K-$70K     B    1y    TX
2   Chicago,IL  $69K-$76K     A    2z    IL
3   Phoenix,AZ  $62K-$72K     a    1z    AZ
4  SanDiego,CA  $71K-$78K     c    1y    CA
0    72
1    70
2    76
3    72
4    78
Name: col_b, dtype: object

In [21]:
df_sample['new']=df_sample['col_c'].str.cat(df_sample['col_d'], sep='-')
df_sample

         col_a      col_b col_c col_d state   new
0   Houston,TX  $64K-$72K     A    1z    TX  A-1z
1    Dallas,TX  $62K-$70K     B    1y    TX  B-1y
2   Chicago,IL  $69K-$76K     A    2z    IL  A-2z
3   Phoenix,AZ  $62K-$72K     a    1z    AZ  a-1z
4  SanDiego,CA  $71K-$78K     c    1y    CA  c-1y